# RevisionFailures Properties

---
The BuiltInFailuresRevisionFailures type exposes the following members.
| Name| Description
---|---|---
| RevisionSettingsDuplicateName|  More than one Revisons have the same name %1!s!.
Top
#### Reference
BuiltInFailuresRevisionFailures Class
Autodesk.Revit.DB Namespace